external/swak/examples/other/angledDuctImplicit/0/heatFluxPoint
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      heatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// this is not the correct dimension. I know

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(front|back|wall|porosityWall)"
    {
        type            groovyBC;
        value           uniform 0;
        valueExpression "toPoint(snGrad(h)*alphat)";
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
