external/swak/examples/other/angledDuctImplicit/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object blockMeshDict; 	
}

convertToMeters 0.001;

vertices
  (
    (-150 0 -25)
    (-150 35.3553 -25)
    (-150 0 25)
    (-150 35.3553 25)
    (0 0 -25)
    (-35.3553 35.3553 -25)
    (0 0 25)
    (-35.3553 35.3553 25)
    (70.7107 70.7107 -25)
    (35.3553 106.066 -25)
    (70.7107 70.7107 25)
    (35.3553 106.066 25)
    (141.421 141.421 -25)
    (106.066 176.777 -25)
    (141.421 141.421 25)
    (106.066 176.777 25)
  ); 	

blocks
  (
    hex

    (
      0
      4
      5
      1
      2
      6
      7
      3
    )
    inlet
    (15 20 20)
    simpleGrading
    (1 1 1)
    hex

    (
      4
      8
      9
      5
      6
      10
      11
      7
    )
    porosity
    (20 20 20)
    simpleGrading
    (1 1 1)
    hex

    (
      8
      12
      13
      9
      10
      14
      15
      11
    )
    outlet
    (20 20 20)
    simpleGrading
    (1 1 1)
  ); 	

edges
  (
  ); 	

patches
  (
    wall
    front

    (

      (
        2
        6
        7
        3
      )

      (
        10
        14
        15
        11
      )
    )
    wall
    back

    (

      (
        1
        5
        4
        0
      )

      (
        9
        13
        12
        8
      )
    )
    wall
    wall

    (

      (
        2
        0
        4
        6
      )

      (
        7
        5
        1
        3
      )

      (
        10
        8
        12
        14
      )

      (
        15
        13
        9
        11
      )
    )
    wall
    porosityWall

    (

      (
        6
        10
        11
        7
      )

      (
        5
        9
        8
        4
      )

      (
        6
        4
        8
        10
      )

      (
        11
        9
        5
        7
      )
    )
    patch
    inlet

    (

      (
        3
        1
        0
        2
      )
    )
    patch
    outlet

    (

      (
        15
        13
        12
        14
      )
    )
  ); 	

mergePatchPairs
  (
  ); 	

boundary
  (
    front

    {
      faces
        (

          (
            2
            6
            7
            3
          )

          (
            10
            14
            15
            11
          )
        );
      type wall;

    }
    back

    {
      faces
        (

          (
            1
            5
            4
            0
          )

          (
            9
            13
            12
            8
          )
        );
      type wall;

    }
    wall

    {
      faces
        (

          (
            2
            0
            4
            6
          )

          (
            7
            5
            1
            3
          )

          (
            10
            8
            12
            14
          )

          (
            15
            13
            9
            11
          )
        );
      type wall;

    }
    porosityWall

    {
      faces
        (

          (
            6
            10
            11
            7
          )

          (
            5
            9
            8
            4
          )

          (
            6
            4
            8
            10
          )

          (
            11
            9
            5
            7
          )
        );
      type wall;

    }
    inlet

    {
      faces
        (

          (
            3
            1
            0
            2
          )
        );
      type patch;

    }
    outlet

    {
      faces
        (

          (
            15
            13
            12
            14
          )
        );
      type patch;

    }
  );

// ************************************************************************* //

